{
  "rules": "\nThe rules (below) are according to Bicycle rules: \n https://bicyclecards.com/how-to-play/blackjack/ \n Note splitting and insurance are not supported, as this is a \n single-hand Blackjack game.",
  "goals": "\nThe goal of Blackjack is to obtain a hand with a value as close to 21 \n as possible, without exceeding 21. Aces are worth either 11 or 1. Face \n cards (Jacks, Queens, or Kings) are each worth 10. All other cards are \n worth their rank. You will be playing against the dealer. If your hand \n is closer to 21 than the dealer, you win! If not, the dealer wins.\n",
  "preround": "\nBefore each round, you will place a bet using your chips. The deck is \n shuffled. You and the dealer will be dealt two cards each. You can see \n both of your cards, as well as one of the dealer's cards.\n",
  "finalrules": "\nNow that you have your hand, to get closer to 21, you may ask for \n another card ('hit') or not ('stand'). You may hit as many times as you \n would like. If you exceed 21, your hand 'busts' and you lose the round, \n and the dealer collects your bet. Once your are satisfied with your \n hand without busting, you will stand. The dealer then plays their own \n hand. Note that the dealer automatically stands when their total is at \n least 17. The winner is whoever is closest to 21 without busting. If \n the dealer wins, your bet is forfeited. If you win, the dealer will pay \n you the equivalent of your bet. If there is a tie, there is a \n 'standoff', and your bet is returned.\n\n If the initial two cards total to 21 (10-card + ace), it is a \n Blackjack. If you have a Blackjack and the dealer does not, you \n automatically win and the dealer pays you 1.5x your bet. If the dealer \n has a Blackjack and you do not, the dealer automatically wins and \n collects your bet. If you both have a Blackjack, there is a standoff, \n and your bet is returned.\n\n This implementation also allows doubling down. If your initial two-card \n hand totals to 9, 10, or 11, you have the option of 'doubling down'. If \n you choose to double down, your bet is doubled. Furthermore you will be \n dealt exactly one more card before standing. The dealer then plays \n their hand as usual, and the payout is settled as usual using the \n doubled bet.\n"
}
